In [23]:
'''
Write a solution to report the name and bonus amount of each employee with a bonus less than 1000.
'''

'\nWrite a solution to report the name and bonus amount of each employee with a bonus less than 1000.\n'

In [24]:
import pandas as pd

In [25]:
employee = {
    "empId": [3,1,2,4],
    "name": ['Brad', 'John', 'Dan', 'Thomas'],
    "supervisor": ["null", 3,3,3],
    "salary": [4000, 1000, 2000, 4000]
}

bonus = {
    "empId": [2,4],
    "bonus": [500, 2000]
}

employeeTable = pd.DataFrame(employee)
bonusTable = pd.DataFrame(bonus)

In [26]:
bonusTable

   empId  bonus
0      2    500
1      4   2000

In [27]:
employeeTable

   empId    name supervisor  salary
0      3    Brad       null    4000
1      1    John          3    1000
2      2     Dan          3    2000
3      4  Thomas          3    4000

In [41]:
def employee_bonus(df1, df2):
    query = df1.merge(df2, on = 'empId', how = 'outer').query('bonus < 1000 | bonus.isnull()')
    return query[['name', "bonus"]]

In [42]:
employee_bonus(employeeTable, bonusTable)

   name  bonus
0  Brad    NaN
1  John    NaN
2   Dan  500.0